In [1]:
import pandas as pd
import os

In [2]:
PATH = "../Datasets/NO2/"

In [3]:
titles = os.listdir(PATH)

Reading files

In [4]:
df = pd.read_excel(PATH + titles[0])

In [5]:
df

     Parámetro       Fecha           Hora  Concentraciones horarias Unidad
0          NaN         NaN            NaN                       NaN    NaN
1          NO2  2018-08-02    7:00 - 8:00                     0.008    ppm
2          NO2  2018-10-11  12:00 - 13:00                     0.005    ppm
3          NO2  2018-11-07    7:00 - 8:00                     0.009    ppm
4          NO2  2018-11-07    8:00 - 9:00                     0.011    ppm
...        ...         ...            ...                       ...    ...
9734       NO2  2020-03-02  18:00 - 19:00                     0.037    ppm
9735       NO2  2020-03-02  19:00 - 20:00                     0.052    ppm
9736       NO2  2020-03-02  20:00 - 21:00                     0.046    ppm
9737       NO2  2020-03-02  21:00 - 22:00                     0.047    ppm
9738       NO2  2020-03-02  22:00 - 23:00                     0.046    ppm

[9739 rows x 5 columns]

Dropping empty instances

In [6]:
df.dropna(how='all', inplace=True)

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9738 entries, 1 to 9738
Data columns (total 5 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Parámetro                 9738 non-null   object
 1   Fecha                     9738 non-null   object
 2   Hora                      9738 non-null   object
 3   Concentraciones horarias  9738 non-null   float64
 4   Unidad                    9738 non-null   object
dtypes: float64(1), object(4)
memory usage: 456.5+ KB

Creating the complete dataset

In [8]:
for df_i in titles[1:]:
    df_i = pd.read_excel(PATH + df_i)
    df_i = df_i.dropna(how='all')
    df = pd.concat([df, df_i], axis=0)

In [9]:
df

     Parámetro       Fecha           Hora  Concentraciones horarias Unidad
1          NO2  2018-08-02    7:00 - 8:00                     0.008    ppm
2          NO2  2018-10-11  12:00 - 13:00                     0.005    ppm
3          NO2  2018-11-07    7:00 - 8:00                     0.009    ppm
4          NO2  2018-11-07    8:00 - 9:00                     0.011    ppm
5          NO2  2019-01-01   23:00 - 0:00                     0.019    ppm
...        ...         ...            ...                       ...    ...
7551       NO2  2025-03-09  18:00 - 19:00                     0.000    ppm
7552       NO2  2025-03-09  19:00 - 20:00                     0.000    ppm
7553       NO2  2025-03-09  20:00 - 21:00                     0.000    ppm
7554       NO2  2025-03-09  21:00 - 22:00                     0.000    ppm
7555       NO2  2025-03-09  22:00 - 23:00                     0.000    ppm

[31033 rows x 5 columns]

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 31033 entries, 1 to 7555
Data columns (total 5 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Parámetro                 31033 non-null  object
 1   Fecha                     31033 non-null  object
 2   Hora                      31033 non-null  object
 3   Concentraciones horarias  31033 non-null  float64
 4   Unidad                    31033 non-null  object
dtypes: float64(1), object(4)
memory usage: 1.4+ MB

Dropping unnecessary columns

In [11]:
df.drop(["Parámetro", "Hora", "Unidad"], axis=1, inplace=True)

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 31033 entries, 1 to 7555
Data columns (total 2 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Fecha                     31033 non-null  object
 1   Concentraciones horarias  31033 non-null  float64
dtypes: float64(1), object(1)
memory usage: 727.3+ KB

Formating dates

In [13]:
df["Fecha"] = pd.to_datetime(df["Fecha"])

In [14]:
df.head()

       Fecha  Concentraciones horarias
1 2018-08-02                     0.008
2 2018-10-11                     0.005
3 2018-11-07                     0.009
4 2018-11-07                     0.011
5 2019-01-01                     0.019

Changing column names

In [15]:
df.rename(columns={"Concentraciones horarias":"NO2"}, inplace=True)

In [16]:
df

          Fecha    NO2
1    2018-08-02  0.008
2    2018-10-11  0.005
3    2018-11-07  0.009
4    2018-11-07  0.011
5    2019-01-01  0.019
...         ...    ...
7551 2025-03-09  0.000
7552 2025-03-09  0.000
7553 2025-03-09  0.000
7554 2025-03-09  0.000
7555 2025-03-09  0.000

[31033 rows x 2 columns]

Grouping per day and taking in consideration the average

In [17]:
df = df.groupby("Fecha", as_index=False).mean()

In [18]:
df

          Fecha       NO2
0    2018-08-02  0.008000
1    2018-10-11  0.005000
2    2018-11-07  0.010000
3    2019-01-01  0.012458
4    2019-01-02  0.013792
...         ...       ...
1378 2025-03-05  0.000000
1379 2025-03-06  0.000000
1380 2025-03-07  0.000000
1381 2025-03-08  0.000000
1382 2025-03-09  0.000000

[1383 rows x 2 columns]

Transformation ppm to ppb

In [19]:
df["NO2"] = df["NO2"]*1000

In [20]:
df

          Fecha        NO2
0    2018-08-02   8.000000
1    2018-10-11   5.000000
2    2018-11-07  10.000000
3    2019-01-01  12.458333
4    2019-01-02  13.791667
...         ...        ...
1378 2025-03-05   0.000000
1379 2025-03-06   0.000000
1380 2025-03-07   0.000000
1381 2025-03-08   0.000000
1382 2025-03-09   0.000000

[1383 rows x 2 columns]

In [21]:
df.describe()

                               Fecha          NO2
count                           1383  1383.000000
mean   2022-03-18 06:03:23.036876288     5.830501
min              2018-08-02 00:00:00     0.000000
25%              2019-12-18 12:00:00     0.000000
50%              2023-03-03 00:00:00     0.000000
75%              2024-02-11 12:00:00     9.104167
max              2025-03-09 00:00:00   376.714286
std                              NaN    14.624768

In [22]:
df.to_csv(PATH + "NO2.csv", index=False)